tutorials/pimpleHFDIBFoam/fallingParticleDistribution/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;
xInlet 0;
//~ xOutlet  12;
xOutlet  12;
//~ xResolution 225;
//~ xResolution 125;
xResolution 100;

ycStart -0.05;
ycyclicLength  0.05; //dp = 2, i.e., 4 diameters per box
ycyclicResolution 1;

zcStart -3;
zcyclicLength  3; //dp = 2, i.e., 4 diameters per box

//~ zcyclicResolution 90;
zcyclicResolution 50;



vertices
(
  ($xInlet  $ycStart       $zcStart)
  ($xOutlet $ycStart       $zcStart)
  ($xOutlet $ycyclicLength $zcStart)
  ($xInlet  $ycyclicLength $zcStart)
  ($xInlet  $ycStart       $zcyclicLength)
  ($xOutlet $ycStart       $zcyclicLength)
  ($xOutlet $ycyclicLength $zcyclicLength)
  ($xInlet  $ycyclicLength $zcyclicLength)


);

blocks
(
  hex (0 1 2 3 4 5 6 7) ($xResolution $ycyclicResolution $zcyclicResolution) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
  z1
{
  //~ type symmetry;
  type wall;
/*         type wall;*/
//        neighbourPatch z0;
  faces
  (
   (4 5 6 7)
  );
}

z0
{
  //~ type symmetry;
  type wall;
/*         type wall;*/
//        neighbourPatch z1;
  faces
  (
   (0 3 2 1)
  );
}

x1
{

type wall;
/*         type wall;*/
neighbourPatch x0;
  faces
  (
  (2 6 5 1)
 );
}

x0
{
type patch;
/*         type wall;*/
neighbourPatch x1;
  faces
  (
  (0 4 7 3)
  );
}

frontAndBack
 {
    //~ type patch;
  type patch;
//     neighbourPatch periodic_y0;
/*        transform translational;*/
/*        separationVector (0 -0.008 0);*/
     faces
     (
     (3 7 6 2)
     (1 5 4 0)
     );
 }



);

mergePatchPairs
(
);

// ************************************************************************* //
