tutorials/pimpleHFDIBFoam/fallingParticleDistribution/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  3.0.x                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
bodyNames ( "icoSphere" );

interpolationSchemes
{
  U cellPointFace;
  method line;
}

surfaceThreshold    1e-4;
stepDEM     0.02;
geometricD (1 -1 1);
recordSimulation true;
virtMeshDecompositionLevel 2;

outputSetup
{
    basic true;
    iB  false;
    DEM false;
    addModel true;
    parallelDEM false;
}

DEM
{
    materials
    {
        particle
        {
            Y       1e7;
            nu      0.3;
            gamma   20;
            mu      0.05;
            adhN    0;
        }

        wall
        {
            Y       1e7;
            nu      0.2;
            gamma   20;
            mu      0;
            adhN    0;
        }
    }

    collisionPatches
    {
        x0 wall;
        x1 wall;
        z0 wall;
        z1 wall;
    }
}

icoSphere
{
fullyCoupledBody;
rho         rho [1 -3 0 0 0 0 0] 3950;
U
{
	BC  noSlip;
}
material particle;
bodyGeom convex;
updateTorque false;
sdBasedLambda false;
interfaceSpan 1.0;
startSynced false;
refineBuffers 2;
timesToSetStatic 30; //number of timeSteps in contact with wall/static body to set body as static. Never when -1
bodyAddition
{
	addModel distribution;
    distributionCoeffs
    {
        stlBaseSize     0.005;
        addMode             fieldBased;
        fieldBasedCoeffs
        {
            fieldName   lambda;                                      //name of the indicator field
            fieldValue	0.05;                                        //minimal field value before addition
        }

        addDomain      boundBox;
        boundBoxCoeffs
        {
            minBound (0 -0.001 -0.03);
            maxBound (0.04 0.001 0.03);
        }

        scalingMode    noScaling;
        noScalingCoeffs{};
        rotationMode   noRotation;
        noRotationCoeffs{};
    }
}
}

// ************************************************************************* //
