tutorials/pimpleHFDIBFoam/fallingParticleDistribution/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  x0
  {
      //~ type            fixedValue;
      //~ value           uniform (0 0 0);
      type            zeroGradient;
  }
  x1
  {
    //~ type            zeroGradient;
    type            noSlip;
  }

  z0
  {
      type            noSlip;
  }

  z1
  {
      type            noSlip;
  }


  frontAndBack
  {
      //~ type            slip;
      type            slip;
  }
}



// ************************************************************************* //
